Ran Plan for dir: `gitops` workspace: `default`

<details><summary>Show Output</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
- destroy

OpenTofu will perform the following actions:

  # aws_s3_bucket.opentofu-day-2025_buckets["opentofu-day-2025-artifacts"] will be destroyed
  # (because aws_s3_bucket.opentofu-day-2025_buckets is not in configuration)
- resource "aws_s3_bucket" "opentofu-day-2025_buckets" {
      - arn                         = "arn:aws:s3:::opentofu-day-2025-artifacts" -> null
      - bucket                      = "opentofu-day-2025-artifacts" -> null
      - bucket_domain_name          = "opentofu-day-2025-artifacts.s3.amazonaws.com" -> null
      - bucket_region               = "us-west-2" -> null
      - bucket_regional_domain_name = "opentofu-day-2025-artifacts.s3.us-west-2.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z3BJ6K6RIION7M" -> null
      - id                          = "opentofu-day-2025-artifacts" -> null
      - object_lock_enabled         = false -> null
      - region                      = "us-west-2" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "Name" = "opentofu-day-2025-artifacts"
        } -> null
      - tags_all                    = {
          - "Name" = "opentofu-day-2025-artifacts"
        } -> null

      - grant {
          - id          = "ed26cb300fbe7d1435622419d2b7ec6dc901fd92a1ffd466eab251aeb9567d66" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # aws_s3_bucket.opentofu-day-2025_buckets["opentofu-day-2025-backups"] will be destroyed
  # (because aws_s3_bucket.opentofu-day-2025_buckets is not in configuration)
- resource "aws_s3_bucket" "opentofu-day-2025_buckets" {
      - arn                         = "arn:aws:s3:::opentofu-day-2025-backups" -> null
      - bucket                      = "opentofu-day-2025-backups" -> null
      - bucket_domain_name          = "opentofu-day-2025-backups.s3.amazonaws.com" -> null
      - bucket_region               = "us-west-2" -> null
      - bucket_regional_domain_name = "opentofu-day-2025-backups.s3.us-west-2.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z3BJ6K6RIION7M" -> null
      - id                          = "opentofu-day-2025-backups" -> null
      - object_lock_enabled         = false -> null
      - region                      = "us-west-2" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "Name" = "opentofu-day-2025-backups"
        } -> null
      - tags_all                    = {
          - "Name" = "opentofu-day-2025-backups"
        } -> null

      - grant {
          - id          = "ed26cb300fbe7d1435622419d2b7ec6dc901fd92a1ffd466eab251aeb9567d66" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # aws_s3_bucket.opentofu-day-2025_buckets["opentofu-day-2025-primary-data"] will be destroyed
  # (because aws_s3_bucket.opentofu-day-2025_buckets is not in configuration)
- resource "aws_s3_bucket" "opentofu-day-2025_buckets" {
      - arn                         = "arn:aws:s3:::opentofu-day-2025-primary-data" -> null
      - bucket                      = "opentofu-day-2025-primary-data" -> null
      - bucket_domain_name          = "opentofu-day-2025-primary-data.s3.amazonaws.com" -> null
      - bucket_region               = "us-west-2" -> null
      - bucket_regional_domain_name = "opentofu-day-2025-primary-data.s3.us-west-2.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z3BJ6K6RIION7M" -> null
      - id                          = "opentofu-day-2025-primary-data" -> null
      - object_lock_enabled         = false -> null
      - region                      = "us-west-2" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "Name" = "opentofu-day-2025-primary-data"
        } -> null
      - tags_all                    = {
          - "Name" = "opentofu-day-2025-primary-data"
        } -> null

      - grant {
          - id          = "ed26cb300fbe7d1435622419d2b7ec6dc901fd92a1ffd466eab251aeb9567d66" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # aws_s3_bucket.opentofu-day-2025_buckets["opentofu-day-2025-temp-storage"] will be destroyed
  # (because aws_s3_bucket.opentofu-day-2025_buckets is not in configuration)
- resource "aws_s3_bucket" "opentofu-day-2025_buckets" {
      - arn                         = "arn:aws:s3:::opentofu-day-2025-temp-storage" -> null
      - bucket                      = "opentofu-day-2025-temp-storage" -> null
      - bucket_domain_name          = "opentofu-day-2025-temp-storage.s3.amazonaws.com" -> null
      - bucket_region               = "us-west-2" -> null
      - bucket_regional_domain_name = "opentofu-day-2025-temp-storage.s3.us-west-2.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z3BJ6K6RIION7M" -> null
      - id                          = "opentofu-day-2025-temp-storage" -> null
      - object_lock_enabled         = false -> null
      - region                      = "us-west-2" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "Name" = "opentofu-day-2025-temp-storage"
        } -> null
      - tags_all                    = {
          - "Name" = "opentofu-day-2025-temp-storage"
        } -> null

      - grant {
          - id          = "ed26cb300fbe7d1435622419d2b7ec6dc901fd92a1ffd466eab251aeb9567d66" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # aws_s3_bucket.opentofu-day-2025_buckets_2["opentofu-day-2025-artifacts"] will be created
+ resource "aws_s3_bucket" "opentofu-day-2025_buckets_2" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "opentofu-day-2025-artifacts"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "us-west-2"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "opentofu-day-2025-artifacts"
        }
      + tags_all                    = {
          + "Name" = "opentofu-day-2025-artifacts"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket.opentofu-day-2025_buckets_2["opentofu-day-2025-backups"] will be created
+ resource "aws_s3_bucket" "opentofu-day-2025_buckets_2" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "opentofu-day-2025-backups"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "us-west-2"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "opentofu-day-2025-backups"
        }
      + tags_all                    = {
          + "Name" = "opentofu-day-2025-backups"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket.opentofu-day-2025_buckets_2["opentofu-day-2025-logs"] will be created
+ resource "aws_s3_bucket" "opentofu-day-2025_buckets_2" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "opentofu-day-2025-logs"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "us-west-2"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "opentofu-day-2025-logs"
        }
      + tags_all                    = {
          + "Name" = "opentofu-day-2025-logs"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket.opentofu-day-2025_buckets_2["opentofu-day-2025-primary-data"] will be created
+ resource "aws_s3_bucket" "opentofu-day-2025_buckets_2" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "opentofu-day-2025-primary-data"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "us-west-2"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "opentofu-day-2025-primary-data"
        }
      + tags_all                    = {
          + "Name" = "opentofu-day-2025-primary-data"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket.opentofu-day-2025_buckets_2["opentofu-day-2025-temp-storage"] will be created
+ resource "aws_s3_bucket" "opentofu-day-2025_buckets_2" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "opentofu-day-2025-temp-storage"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "us-west-2"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "opentofu-day-2025-temp-storage"
        }
      + tags_all                    = {
          + "Name" = "opentofu-day-2025-temp-storage"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

Plan: 5 to add, 0 to change, 4 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d gitops
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://53c332340d8a.ngrok-free.app/lock?id=gracebrickley%252Fopentofudemo%252Fgitops%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d gitops
  ```
Plan: 5 to add, 0 to change, 4 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```